# SQL Assignment

In [1]:
import pandas as pd
import sqlite3

from IPython.display import display, HTML

In [2]:
# Note that this is not the same db we have used in course videos, please download from this link
# https://drive.google.com/file/d/1O-1-L1DdNxEK6O6nG2jS31MbrMh-OnXM/view?usp=sharing

In [3]:
conn = sqlite3.connect(r"C:\Users\adi97\Downloads\Db-IMDB-Assignment.db")

#### Overview of all tables

In [4]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = tables["Table_Name"].values.tolist()

In [5]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,conn)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of Movie

   cid       name     type  notnull dflt_value  pk
0    0      index  INTEGER        0       None   0
1    1        MID     TEXT        0       None   0
2    2      title     TEXT        0       None   0
3    3       year     TEXT        0       None   0
4    4     rating     REAL        0       None   0
5    5  num_votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    CID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    LID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    LID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    CID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Person

   cid    name     type  notnull dflt_value  pk
0    0   index  INTEGER        0       None   0
1    1     PID     TEXT        0       None   0
2    2    Name     TEXT        0       None   0
3    3  Gender     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Producer

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Director

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Cast

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

## Useful tips:

1. the year column in 'Movie' table, will have few chracters other than numbers which you need to be preprocessed, you need to get a substring of last 4 characters, its better if you convert it as int type, ex: CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)

2. For almost all the TEXT columns we have show, please try to remove trailing spaces, you need to use TRIM() function

3. When you are doing count(coulmn) it won't consider the "NULL" values, you might need to explore other alternatives like Count(*)

## Q1 --- List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedy’ and year is a leap year) Your query should return director name, the movie name, and the year.

<h4>To determine whether a year is a leap year, follow these steps:</h4>

<ul>
    <li><b>STEP-1:</b> If the year is evenly divisible by 4, go to step 2. Otherwise, go to step 5.</li>
    <li><b>STEP-2:</b> If the year is evenly divisible by 100, go to step 3. Otherwise, go to step 4.</li>
    <li><b>STEP-3:</b> If the year is evenly divisible by 400, go to step 4. Otherwise, go to step 5.</li>
    <li><b>STEP-4:</b> The year is a leap year (it has 366 days).</li>
    <li><b>STEP-5:</b> The year is not a leap year (it has 365 days).</li>
</ul>

Year 1900 is divisible by 4 and 100 but it is not divisible by 400, so it is not a leap year.

In [6]:
%%time
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    assert (q1_results.shape == (232,3))

query1 = """ SELECT P.name, CAST(SUBSTR(TRIM(year),-4) AS INTEGER) as mov_year, m.title 
             FROM Movie m JOIN M_Director d ON d.MID = m.MID JOIN Person p ON p.PID = d.PID WHERE mov_year%4 = 0 AND m.MID IN
             (SELECT MID FROM M_Genre WHERE GID IN 
             (SELECT GID FROM Genre WHERE Name LIKE '%COMEDY%'))"""
grader_1(query1)

                Name  mov_year                              title
0       Milap Zaveri      2016                         Mastizaade
1       Danny Leiner      2004  Harold & Kumar Go to White Castle
2     Anurag Kashyap      2012                 Gangs of Wasseypur
3       Frank Coraci      2004        Around the World in 80 Days
4      Griffin Dunne      2008             The Accidental Husband
5        Anurag Basu      2012                             Barfi!
6    Gurinder Chadha      2004                  Bride & Prejudice
7         Mike Judge      1996    Beavis and Butt-Head Do America
8   Tarun Mansukhani      2008                            Dostana
9       Shakun Batra      2016                      Kapoor & Sons
Wall time: 224 ms

## Q2 --- List the names of all the actors who played in the movie 'Anand' (1971)

In [7]:
%%time
def grader_2(q2):
    q2_results  = pd.read_sql_query(q2,conn)
    print(q2_results.head(10))
    print(q2_results.shape)
    assert (q2_results.shape == (17,1))


query2 = """ SELECT p.Name FROM Person p WHERE TRIM(p.PID) IN 
             (SELECT TRIM(mc.PID) FROM M_Cast mc WHERE TRIM(mc.MID) IN 
             (SELECT TRIM(m.MID) FROM Movie m WHERE CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)=1971 and m.title='Anand'));"""
grader_2(query2)

                Name
0   Amitabh Bachchan
1      Rajesh Khanna
2      Sumita Sanyal
3         Ramesh Deo
4          Seema Deo
5     Asit Kumar Sen
6         Dev Kishan
7       Atam Prakash
8      Lalita Kumari
9             Savita
(17, 1)
Wall time: 97.9 ms

## Q3 --- List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

In [8]:
%%time

def grader_3a(query_less_1970, query_more_1990):
    q3_a = pd.read_sql_query(query_less_1970,conn)
    q3_b = pd.read_sql_query(query_more_1990,conn)
    print("Actors who acted in Movies before 1970")
    print(q3_a.head(10))
    print(q3_a.shape)
    print("Actors who acted in Movies after 1990")
    print(q3_b.head(10))
    print(q3_b.shape)
    return (q3_a.shape == (4942,1)) and (q3_b.shape == (62570,1))

query_less_1970 =""" SELECT p.Name FROM Person p JOIN

                     (SELECT TRIM(mc.PID) pd, mc.MID FROM M_cast mc WHERE mc.MID IN 
                     
                     (SELECT m.MID from Movie m where CAST(SUBSTR(m.year,-4) AS Integer)<1970))
                     
                     AS tab ON tab.pd=p.PID;"""

query_more_1990 =""" SELECT p.Name FROM Person p JOIN

                     (SELECT TRIM(mc.PID) pd, mc.MID FROM M_cast mc WHERE mc.MID IN
                     
                     (SELECT m.MID from Movie m where CAST(SUBSTR(m.year,-4) AS Integer)>1990))
                     
                     AS tab ON tab.pd=p.PID;"""

print(grader_3a(query_less_1970, query_more_1990))

# using the above two queries, you can find the answer to the given question

Actors who acted in Movies before 1970
              Name
0   Michael Rennie
1    Patricia Neal
2     Hugh Marlowe
3        Sam Jaffe
4       Billy Gray
5   Frances Bavier
6      Lock Martin
7   Patrick Aherne
8     Walter Bacon
9         Rama Bai
(4942, 1)
Actors who acted in Movies after 1990
                    Name
0         Christian Bale
1         Cate Blanchett
2   Benedict Cumberbatch
3          Naomie Harris
4            Andy Serkis
5           Peter Mullan
6            Jack Reynor
7           Eddie Marsan
8          Tom Hollander
9           Matthew Rhys
(62570, 1)
True
Wall time: 962 ms

## Q4 --- List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [9]:
%%time

def grader_4a(query_4a):
    query_4a = pd.read_sql_query(query_4a,conn)
    print(query_4a.shape)
    print(query_4a.head(10)) 
    assert (query_4a.shape == (1462,2))
#Director Name, Number of Movies in Descending (10 movies or more)

query_4a =""" WITH T1 (MID,PID) AS
              (SELECT TRIM(md.MID),TRIM(md.PID) FROM M_Director md)

              SELECT p.Name as Director_Name,COUNT(*) as Movie_Count FROM 
              
              Person p JOIN T1 ON p.PID=TRIM(T1.PID)
              
              GROUP BY Director_Name HAVING Movie_Count>=10 ORDER BY Movie_Count DESC;"""

print(grader_4a(query_4a))

# using the above query, you can write the answer to the given question

(58, 2)
           Director_Name  Movie_Count
0           David Dhawan           39
1           Mahesh Bhatt           36
2           Priyadarshan           30
3        Ram Gopal Varma           30
4           Vikram Bhatt           29
5   Hrishikesh Mukherjee           27
6            Yash Chopra           21
7         Shakti Samanta           19
8        Basu Chatterjee           19
9           Subhash Ghai           18

AssertionError:

## Q5.a --- For each year, count the number of movies in that year that had only female actors.

In [10]:
%%time

# note that you don't need TRIM for person table

def grader_5aa(query_5aa):
    query_5aa = pd.read_sql_query(query_5aa,conn)
    print(query_5aa.head(10)) 
    return (query_5aa.shape == (8846,3))

#Write your query that will get movie id, and number of people for each gender as Below
#  Movie ID     Gender   Count of Gender
#       1         Male       3
#       1         Female     4
#       2         Male       4
#       2         Female     3
# ....

query_5aa = """

         WITH T1 (PID,MID) AS
        (SELECT * FROM
        (Select TRIM(mc.PID),TRIM(mc.MID) FROM M_Cast mc)),
        
         T2 (PID,MID,Name,Gender) AS
        (SELECT T1.PID AS PID,T1.MID AS MID, p.Name AS NAME,p.Gender AS Gender FROM 
         T1 JOIN Person p ON T1.PID=p.PID),
        
         T3 (MID,GENDER,GENDER_COUNT) AS
         (SELECT T2.MID AS MID,T2.Gender AS GENDER,COUNT(T2.GENDER) AS GENDER_COUNT
         FROM T2 GROUP BY MID,Gender)
        
         SELECT * FROM T3;
         
         """

print(grader_5aa(query_5aa))

def grader_5ab(query_5ab):
    query_5ab = pd.read_sql_query(query_5ab,conn)
    print(query_5ab.head(10)) 
    return (query_5ab.shape == (3469, 3))

query_5ab ="""

         WITH T1 (PID,MID) AS
        (SELECT * FROM
        (Select TRIM(mc.PID),TRIM(mc.MID) FROM M_Cast mc)),
        
         T2 (PID,MID,Name,Gender) AS
        (SELECT T1.PID AS PID,T1.MID AS MID, p.Name AS NAME,p.Gender AS Gender FROM 
         T1 JOIN Person p ON T1.PID=p.PID),
        
         T3 (MID,GENDER,GENDER_COUNT) AS
         (SELECT T2.MID AS MID,T2.Gender AS GENDER,COUNT(T2.GENDER) AS GENDER_COUNT
         FROM T2 GROUP BY MID,GENDER HAVING GENDER LIKE 'Male' AND GENDER_COUNT>=1)
        
         SELECT * FROM T3;
         
         """

print(grader_5ab(query_5ab))


# using the above queries, you can write the answer to the given question

         MID  GENDER  GENDER_COUNT
0  tt0021594    None             0
1  tt0021594  Female             3
2  tt0021594    Male             5
3  tt0026274    None             0
4  tt0026274  Female            11
5  tt0026274    Male             9
6  tt0027256    None             0
7  tt0027256  Female             5
8  tt0027256    Male             8
9  tt0028217  Female             3
True
         MID GENDER  GENDER_COUNT
0  tt0021594   Male             5
1  tt0026274   Male             9
2  tt0027256   Male             8
3  tt0028217   Male             7
4  tt0031580   Male            27
5  tt0033616   Male            46
6  tt0036077   Male            11
7  tt0038491   Male             7
8  tt0039654   Male             6
9  tt0040067   Male            10
True
Wall time: 1.25 s

In [11]:
%%time
def grader_5a(q5a):
    q5a_results  = pd.read_sql_query(q5a,conn)
    print(q5a_results.shape)
    print(q5a_results.head(10))
    assert (q5a_results.shape == (4,2))
    
# Return (Year,Number of Movies Having Only Female Actors)

query5a = """
         WITH T1 (PID,MID) AS
        (SELECT * FROM
        (Select TRIM(mc.PID),TRIM(mc.MID) FROM M_Cast mc)),
        
         T2 (PID,MID,Name,Gender) AS
        (SELECT T1.PID AS PID,T1.MID AS MID, p.Name AS NAME,p.Gender AS Gender FROM 
         T1 JOIN Person p ON T1.PID=p.PID),
        
         T3 (MID,GENDER,GENDER_COUNT) AS
         (SELECT T2.MID AS MID,T2.Gender AS GENDER,COUNT(T2.GENDER) AS GENDER_COUNT
         FROM T2 GROUP BY MID,GENDER HAVING GENDER LIKE 'Male' AND GENDER_COUNT>=1),
         
         T4 (MID,GENDER,GENDER_COUNT) AS
         (SELECT T2.MID AS MID,T2.Gender AS GENDER,COUNT(T2.GENDER) AS GENDER_COUNT
         FROM T2 GROUP BY MID,GENDER),
         
         T5 (MID,GENDER,GENDER_COUNT) AS
         (SELECT T4.* FROM T4 WHERE T4.MID NOT IN
         (SELECT T3.MID FROM T3)),
         
         T6 (Year,Num_Movies_Only_Female_Act) AS
         (SELECT CAST(SUBSTR(m.year,-4) AS Integer) AS Year,COUNT(*) AS Num_Movies_Only_Female_Act FROM Movie m
         JOIN T5 ON TRIM(m.MID)=TRIM(T5.MID)
         GROUP BY Year)
          
         SELECT * FROM T6;
         
         """
grader_5a(query5a)

(4, 2)
   Year  Num_Movies_Only_Female_Act
0  1939                           1
1  1999                           1
2  2000                           1
3  2018                           1
Wall time: 1.3 s

## Q5.b --- Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [12]:
%%time
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results.head(10))
    assert (q5b_results.shape == (4,3))

query5b = """ WITH T1 (PID,MID) AS
        (SELECT * FROM
        (Select TRIM(mc.PID),TRIM(mc.MID) FROM M_Cast mc)),
        
         T2 (PID,MID,Name,Gender) AS
        (SELECT T1.PID AS PID,T1.MID AS MID, p.Name AS NAME,p.Gender AS Gender FROM 
         T1 JOIN Person p ON T1.PID=p.PID),
        
         T3 (MID,GENDER,GENDER_COUNT) AS
         (SELECT T2.MID AS MID,T2.Gender AS GENDER,COUNT(T2.GENDER) AS GENDER_COUNT
         FROM T2 GROUP BY MID,GENDER HAVING GENDER LIKE 'Male' AND GENDER_COUNT>=1),
         
         T4 (MID,GENDER,GENDER_COUNT) AS
         (SELECT T2.MID AS MID,T2.Gender AS GENDER,COUNT(T2.GENDER) AS GENDER_COUNT
         FROM T2 GROUP BY MID,GENDER),
         
         T5 (MID,GENDER,GENDER_COUNT) AS
         (SELECT T4.* FROM T4 WHERE T4.MID NOT IN
         (SELECT T3.MID FROM T3)),
         
         T6 (Year,Num_Movies_Only_Female_Act,MID) AS
         (SELECT CAST(SUBSTR(m.year,-4) AS Integer) AS Year, COUNT(*) AS Num_Movies_Only_Female_Act,m.MID AS MID FROM Movie m
         JOIN T5 ON TRIM(m.MID)=TRIM(T5.MID)
         GROUP BY Year),
         
         T7 (Year,Total_Mov_In_Year) AS
         (SELECT CAST(SUBSTR(m.year,-4) AS Integer) AS Year, COUNT(m.MID) AS Total_Mov_In_Year 
         FROM Movie m
         GROUP BY Year),
         
         T8 (YEAR,Num_Movies_Only_Female_Act,Total_Mov_In_Year) AS
         (SELECT Year,Num_Movies_Only_Female_Act,SUM(Total_Mov_In_Year) AS Total_Mov_In_Year FROM (
         SELECT T6.YEAR AS YEAR,T6.Num_Movies_Only_Female_Act AS Num_Movies_Only_Female_Act,T7.Total_Mov_In_Year AS Total_Mov_In_Year
         FROM T6 JOIN T7 ON T6.Year=T7.Year)
         GROUP BY Year)
         
         SELECT Year,CAST((Num_Movies_Only_Female_Act) AS FLOAT)/CAST((Total_Mov_In_Year) AS FLOAT) AS Percentage_Female_Movies,Total_Mov_In_Year FROM T8; """


grader_5b(query5b)

   YEAR  Percentage_Female_Movies  Total_Mov_In_Year
0  1939                  0.500000                  2
1  1999                  0.015152                 66
2  2000                  0.015625                 64
3  2018                  0.009615                104
Wall time: 1.31 s

## Q6 --- Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [13]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.shape)
    print(q6_results.head(10))
    assert (q6_results.shape == (3473, 2))
    
#DISTINCT KEYWORD IS USED TO SELECT DISTINCT ACTORS IN A MOVIE

query6 = """ WITH T1(PID,MID) AS
             (SELECT DISTINCT(mc.PID) AS PID,mc.MID AS MID
             FROM M_Cast mc),
             
             T2 (Title,MID,Cast_Count) AS
             (SELECT m.title,m.MID,COUNT(PID) AS Cast_Count FROM T1
             JOIN Movie m ON m.MID=T1.MID
             GROUP BY m.MID)
             
             SELECT Title,Cast_Count FROM T2
             ORDER BY Cast_Count DESC ;"""
grader_6(query6)

(3473, 2)
                        Title  Cast_Count
0               Ocean's Eight         238
1                    Apaharan         233
2                        Gold         215
3             My Name Is Khan         213
4  Captain America: Civil War         191
5                    Geostorm         170
6                     Striker         165
7                        2012         154
8                      Pixels         144
9       Yamla Pagla Deewana 2         140
Wall time: 996 ms

### Q7 --- A decade is a sequence of 10 consecutive years. 
### For example, say in your database you have movie information starting from 1931. 
### the first decade is 1931, 1932, ..., 1940,
### the second decade is 1932, 1933, ..., 1941 and so on. 
### Find the decade D with the largest number of films and the total number of films in D

In [14]:
%%time
def grader_7a(q7a):
    q7a_results  = pd.read_sql_query(q7a,conn)
    print(q7a_results.shape)
    print(q7a_results.head(10))
    assert (q7a_results.shape == (78, 2))

#*** Write a query that computes number of movies in each year ***
query7a = """ SELECT CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) AS Year,COUNT(m.MID) AS Mov_Count FROM Movie m
              GROUP BY CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)"""
grader_7a(query7a)

# using the above query, you can write the answer to the given question

(78, 2)
   Year  Mov_Count
0  1931          1
1  1936          3
2  1939          2
3  1941          1
4  1943          1
5  1946          2
6  1947          2
7  1948          3
8  1949          3
9  1950          2
Wall time: 25.3 ms

In [15]:
%%time
def grader_7b(q7b):
    q7b_results  = pd.read_sql_query(q7b,conn)
    print(q7b_results.shape)
    print(q7b_results.head(10))
    assert (q7b_results.shape == (713, 4))
"""   
*** 
    Write a query that will do joining of the above table(7a) with itself 
    such that you will join with only rows if the second tables year is <= current_year+9 and more than or equal current_year
*** 
"""

query7b = """ 
           WITH T1 (Year,Mov_Count) AS 
           (SELECT CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) AS Year,COUNT(m.MID) AS Mov_Count FROM Movie m
           GROUP BY CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)),
           
           T2 (Year,Mov_Count) AS 
           (SELECT CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) AS Year,COUNT(m.MID) AS Mov_Count FROM Movie m
           GROUP BY CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER))
           
           SELECT * FROM T1 JOIN T2 ON T2.Year<=T1.Year+9 AND T2.Year>=T1.Year; 
 
          """
grader_7b(query7b)
# if you see the below results the first movie year is less than 2nd movie year and 
# 2nd movie year is less or equal to the first movie year+9

# using the above query, you can write the answer to the given question

(713, 4)
   Year  Mov_Count  Year  Mov_Count
0  1931          1  1931          1
1  1931          1  1936          3
2  1931          1  1939          2
3  1936          3  1936          3
4  1936          3  1939          2
5  1936          3  1941          1
6  1936          3  1943          1
7  1939          2  1939          2
8  1939          2  1941          1
9  1939          2  1943          1
Wall time: 42 ms

In [16]:
%%time
def grader_7(q7):
    q7_results  = pd.read_sql_query(q7,conn)
    print(q7_results.head(10))
    assert (q7_results.shape == (1, 2))

query7 = """ *** Write a query that will return the decade that has maximum number of movies ***"""
grader_7(query7)
# if you check the output we are printinng all the year in that decade, its fine you can print 2008 or 2008-2017

DatabaseError: Execution failed on sql ' *** Write a query that will return the decade that has maximum number of movies ***': near "*": syntax error

## Q8 --- Find all the actors that made more movies with Yash Chopra than any other director.

In [17]:
%%time
def grader_8a(q8a):
    q8a_results  = pd.read_sql_query(q8a,conn)
    print(q8a_results.head(10))
    print(q8a_results.shape)
    assert (q8a_results.shape == (73408, 3))
    
#Write a query that will results in number of movies actor-director worked together
query8a = """ 
         With T1 (MID,Director,Actor) AS
         (SELECT md.MID,md.PID AS Director,mc.PID AS Actor FROM M_Director md
         INNER JOIN M_Cast mc ON md.MID=mc.MID)\
         
         SELECT Actor,Director,COUNT(*) AS Mov_Count FROM T1
         GROUP BY Actor,Director
                            
    """

grader_8a(query8a)

# using the above query, you can write the answer to the given question

        Actor   Director  Mov_Count
0   nm0000002  nm0496746          1
1   nm0000027  nm0000180          1
2   nm0000039  nm0896533          1
3   nm0000042  nm0896533          1
4   nm0000047  nm0004292          1
5   nm0000073  nm0485943          1
6   nm0000076  nm0000229          1
7   nm0000092  nm0178997          1
8   nm0000093  nm0000269          1
9   nm0000096  nm0113819          1
(73408, 3)
Wall time: 1.17 s

In [18]:
%%time

def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.head(10))
    print(q8_results.shape)
    assert (q8_results.shape == (245, 2))

query8 = """
         WITH T1 (MID,Director,Actor) AS
         (SELECT md.MID,md.PID AS Director,mc.PID AS Actor FROM M_Director md
         INNER JOIN M_Cast mc ON md.MID=mc.MID),
         
         T2 (Actor,Director,Mov_Count) AS
         (SELECT Actor,Director,COUNT(*) As Mov_count FROM T1
         GROUP BY Actor,Director), 
         
         T3 AS
         (SELECT DENSE_RANK() OVER (Partition BY Actor Order By Mov_Count DESC ) as No_Of_Movies,Actor,Director FROM T2),
         
         T4 AS
         (SELECT p.Name as Actor_Name,T3.Director,T3.No_Of_Movies FROM Person p JOIN T3 ON T3.Actor=p.PID)
         
         SELECT * FROM T4;
         
         """
grader_8(query8)

Empty DataFrame
Columns: [Actor_Name, Director, No_Of_Movies]
Index: []
(0, 3)

AssertionError:

## Q9 --- The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [46]:
%%time
def grader_9a(q9a):
    q9a_results  = pd.read_sql_query(q9a,conn)
    print(q9a_results.head(10))
    print(q9a_results.shape)
    assert (q9a_results.shape == (2382, 1))

query9a = """
          /*Getting SRK PID*/
          WITH T1 (PID) AS
          (SELECT DISTINCT(TRIM(p.PID)) AS PID FROM Person p WHERE p.Name LIKE '%Shah Rukh Khan%'), 
          
          T2 (MID) AS
          (SELECT TRIM(mc.MID) as MID FROM M_Cast mc WHERE TRIM(mc.PID)=(SELECT PID FROM T1)),
          
          T3 (PID) AS
          (SELECT mc.PID AS PID FROM M_Cast mc WHERE TRIM(mc.MID) IN (SELECT MID FROM T2))
          
          SELECT * FROM T3;"""
grader_9a(query9a)

# using the above query, you can write the answer to the given question

# selecting actors who acted with srk (S1)
# selecting all movies where S1 actors acted, this forms S2 movies list
# selecting all actors who acted in S2 movies, this gives us S2 actors along with S1 actors
# removing S1 actors from the combined list of S1 & S2 actors, so that we get only S2 actors

          PID
0   nm0451321
1   nm0004418
2   nm1995953
3   nm2778261
4   nm0631373
5   nm0241935
6   nm0792116
7   nm1300111
8   nm0196375
9   nm1464837
(3313, 1)

AssertionError:

In [36]:
%%time
def grader_9(q9):
    q9_results  = pd.read_sql_query(q9,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (25698, 1))

query9 = """
          /*Getting SRK PID*/
          WITH T1 (PID) AS
          (SELECT DISTINCT(p.PID) AS PID FROM Person p WHERE p.Name LIKE '%Shah Rukh Khan%'),
          
          /*Getting MIDs where PID= SRK PID*/
          T2 (MID,PID) AS
          (SELECT TRIM(mc.MID),TRIM(mc.PID) FROM M_Cast mc WHERE TRIM(mc.PID) = (SELECT PID FROM T1)),
          
          /*Getting MIDs where PID = SRK Movies/
          T3 (PID,MID) AS
          (SELECT TRIM(mc.PID),TRIM(mc.MID) FROM M_Cast mc WHERE mc.MID IN (SELECT MID FROM T2)),
          
          T4 (PID) AS
          (SELECT DISTINCT(mc.PID) AS PID FROM M_Cast mc WHERE TRIM(mc.PID) NOT IN (SELECT DISTINCT(PID) FROM T3))
          
          SELECT * FROM T4;"""
grader_9(query9)

          PID
0   nm0000288
1   nm0000949
2   nm1212722
3   nm0365140
4   nm0785227
5   nm0611932
6   nm2930503
7   nm0550371
8   nm0390903
9   nm0722629
(29744, 1)

AssertionError: